th0truth/STM32-ADC-Control/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "stm32f4xx_hal_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
#include <stdint.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define ADC_CHANNELS 3
#define ADC_FULL_SCALE 4096
#define DIGITAL_INPUTS 1
#define PWM_OUTPUTS 3

// Define named pins
#define LED_PB0_Pin GPIO_PIN_0
#define LED_PB1_Pin GPIO_PIN_1
#define LED_PB2_Pin GPIO_PIN_2
#define LED_PB3_Pin GPIO_PIN_3
#define LED_PB4_Pin GPIO_PIN_4
#define LED_PB5_Pin GPIO_PIN_5
#define LED_PB6_Pin GPIO_PIN_6
#define LED_PB7_Pin GPIO_PIN_7

#define BUTTON_Pin GPIO_PIN_13

#define NUM_LEDS 8

// Button thresholds (in ms)
#define PRESS_SHORT_TIME_MS 300
#define PRESS_LONG_TIME_MS 500 
#define PRESS_DOUBLE_TIME_MS 500

// Random
#define RAND_BUFFER_SIZE 16

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

TIM_HandleTypeDef htim1;

osThreadId defaultTaskHandle;
osThreadId RandNumHandle;
osThreadId LED_PC15Handle;
osThreadId LED_PC13Handle;
/* USER CODE BEGIN PV */

// Buffer to store ADC readings from 3 channels 
uint16_t adc_buffer[ADC_CHANNELS];

// Which sensor (0, 1, 2) we'are currently displaying
uint8_t current_channel = 0;

// There're two options (0 - bar graph | 1 - binary)
uint8_t display_mode = 0;

// Running light animation (0 - normal display | 1 - one LED moves back and forth)
bool running_mode = false;

// Button handling variables
typedef struct {
  bool is_button_pressed;
  uint32_t press_time; // in seconds
  uint32_t last_release; // in seconds
  uint32_t click_count;
} ButtonInput;

ButtonInput button_input = {
  .is_button_pressed = false,
  .press_time = 0, // in seconds
  .last_release = 0, // in seconds
  .click_count = 0, // for double clicks
};

// Running LED animation state
typedef struct{
  bool direction;
  uint8_t position;
  uint32_t last_update_time;
} RunningLED;

RunningLED running_led = {
  .position = 0,
  .last_update_time = 0,
  .direction = true,
};

uint32_t random_buffer[RAND_BUFFER_SIZE] = {0};
uint8_t random_buffer_index = 0;

// Mutex for thread-safe random number access
osMutexId randomMutexHandle;

// Set LED (GPIO) pins 
GPIO_TypeDef *led_ports[NUM_LEDS] = {
  LED_PB0_GPIO_Port, LED_PB1_GPIO_Port, LED_PB2_GPIO_Port, LED_PB3_GPIO_Port,
  LED_PB4_GPIO_Port, LED_PB5_GPIO_Port, LED_PB6_GPIO_Port, LED_PB7_GPIO_Port
};
  
uint16_t led_pins[NUM_LEDS] = {
  LED_PB0_Pin, LED_PB1_Pin, LED_PB2_Pin, LED_PB3_Pin,
  LED_PB4_Pin, LED_PB5_Pin, LED_PB6_Pin, LED_PB7_Pin
};

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM1_Init(void);
void StartDefaultTask(void const * argument);
void RandNum_Task(void const * argument);
void LED_PC15_Task(void const * argument);
void LED_PC04_Task(void const * argument);

/* USER CODE BEGIN PFP */
void set_NUM_LEDS(uint8_t pattern);
void Display_Scale(uint16_t adc_buffer);
void Display_Bits(uint16_t adc_value);
void Indicate_Channels(uint8_t channel);
void Update_Running_LED(void);
void Update_PWM_Outputs(void);
void Handle_Button(void);
uint32_t ADC_Random_Byte(void);
uint32_t ADC_Random_Word(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// Set LED GPIO pins 
void set_NUM_LEDS(uint8_t pattern)
{
  for (uint16_t i = 0; i < NUM_LEDS; i++)
  {
    HAL_GPIO_WritePin(led_ports[i], led_pins[i],
    (pattern & (1 << i)) ?  GPIO_PIN_SET : GPIO_PIN_RESET);
  }
}

// The bar graph scale mode for 8 NUM_LEDS
void Display_Scale(uint16_t adc_value)
{
  // Convert ADC_value (0-4095) to the LED count (0-8)
  // It results which led is lighting - (0-8)
  uint8_t led_count = (adc_value * 9) / ADC_FULL_SCALE;
  uint8_t pattern = 0;

  // It does bit shifting manipulation (shift it left by i pos)
  for (uint16_t i = 0; i < led_count; i++)
  {
    pattern = pattern | (1 << i);    
  }

  set_NUM_LEDS(pattern);
}

// Display upper 8 bits of ADC value in binary
void Display_Bits(uint16_t adc_value)
{
  uint8_t upper_bits = (adc_value >> 4) & 0xFF;
  set_NUM_LEDS(upper_bits);
}

// Blink all NUM_LEDS to indicate channel number
void Indicate_Channel(uint8_t channel)
{
  // Blink (channel + 1) times 
  for (uint8_t i = 0; i < (channel + 1); i++)
  {
    set_NUM_LEDS(0xFF); // All NUM_LEDS ON
    HAL_Delay(200);
    set_NUM_LEDS(0x00); // All NUM_LEDS OFF
    HAL_Delay(200);
  }
}

