th0truth/STM32-ADC-Control/Core/Src/main.c
// Update running LED animation
void Update_Running_LED(void)
{
  uint16_t adc_value = adc_buffer[current_channel];

  // Calculate delay based on Button thresholds and ADC value
  uint32_t delay = PRESS_LONG_TIME_MS - ((adc_value * (PRESS_LONG_TIME_MS - PRESS_SHORT_TIME_MS)) / ADC_FULL_SCALE);
  uint32_t current_time = HAL_GetTick();

  if (current_time - running_led.last_update_time >= delay)
  {
    running_led.last_update_time = current_time;

    // Light only the current LED
    set_NUM_LEDS(1 << running_led.position);
    
    if (running_led.direction)
    {
      running_led.position++;
      if (running_led.position >= (NUM_LEDS - 1))
      {
        running_led.position = NUM_LEDS - 1;
        running_led.direction = false; // Reverse direction
      }
    } else {
      // Moving backward
      if (running_led.position == 0)
      {
        running_led.direction = true;
      } else {
        running_led.position--;
      }
    }
  }
}

void Update_PWM_Outputs(void)
{
  uint32_t pwm_period = htim1.Init.Period; 

  // Set PWM duty cycle proportional to ADC value
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, (adc_buffer[0] * pwm_period) / ADC_FULL_SCALE);
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, (adc_buffer[1] * pwm_period) / ADC_FULL_SCALE);
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, (adc_buffer[2] * pwm_period) / ADC_FULL_SCALE);
}

void Handle_Button(void)
{
  bool button_state = (HAL_GPIO_ReadPin(GPIOC, BUTTON_Pin) == GPIO_PIN_RESET);
  uint32_t current_time = HAL_GetTick();

  // Button PRESS detection
  if (button_state && !button_input.is_button_pressed)
  {
    button_input.is_button_pressed = true;
    button_input.press_time = current_time; 
  }

  // Button RELEASE detection
  if (!button_state && button_input.is_button_pressed)
  {
    button_input.is_button_pressed = false;
    uint32_t press_duration = current_time - button_input.press_time;

    // SHORT PRESS (<300ms)
    if (press_duration < PRESS_SHORT_TIME_MS)
    {
      // Check for double click
      if (current_time - button_input.last_release < PRESS_DOUBLE_TIME_MS)
      {
        button_input.click_count++;
        
        if (button_input.click_count == 2)
        {
          // DOUBLE CLICK - Toggle running mode
          running_mode = !running_mode;
          
          if (running_mode)
          {
            running_led.position = 0;
            running_led.direction = true;
            running_led.last_update_time = current_time;
          }
          
          button_input.click_count = 0;
        }
      } else {
        // SINGLE SHORT PRESS - Toggle display mode
        if (!running_mode)
        {
          display_mode = !display_mode;
        }
        button_input.click_count = 1;
      }
      
      button_input.last_release = current_time;
    }
    // LONG PRESS (>=500ms)
    else if (press_duration >= PRESS_LONG_TIME_MS)
    {
      // Change channel
      running_mode = false;
      current_channel = (current_channel + 1) % ADC_CHANNELS;
      Indicate_Channel(current_channel);
      button_input.click_count = 0;
    }
  }
  
  // Reset click counter if timeout
  if (current_time - button_input.last_release > PRESS_DOUBLE_TIME_MS && 
      button_input.click_count == 1)
  {
    button_input.click_count = 0;
  }
}

// Uses least significant bits which contain thermal noise   
uint32_t ADC_Random_Byte(void)
{
  uint8_t random = 0;

  // Collect Least Significnt Bits multiple ADC samples
  for (int i = 0; i < 8; i++)
  {
    uint32_t bit = adc_buffer[i % ADC_CHANNELS] & 0x01;
    random = (random << 1) | bit;

    for (volatile int j = 0; j < 100; j++);
  }

  return random;
}

// Get 32-bit random from ADC
uint32_t ADC_Random_Word(void)
{
  uint32_t random = 0;

  random |= ((uint32_t)ADC_Random_Byte()) << 13;
  random |= ((uint32_t)ADC_Random_Byte() << 17);
  random |= ((uint32_t)ADC_Random_Byte() << 5);
  random |= ((uint32_t)ADC_Random_Byte());
  
  return random;
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */

  // Start ADC with DMA
  if (HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_buffer, sizeof(adc_buffer) / sizeof(adc_buffer[0])) != HAL_OK)
  {
    while (1)
    {
      set_NUM_LEDS(0xFF); // All NUM_LEDS ON
      HAL_Delay(100);
      set_NUM_LEDS(0x00); // All NUM_LEDS OFF 
      HAL_Delay(200);
    }
  }

  // Start PWM on all 3 channels
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);

  // Initial indication: show channel 0 selected
  Indicate_Channel(current_channel);
  
  // Small delay before entering main loop
  HAL_Delay(500);

  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
    // Create mutex for random number access
  
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of RandNum */
  osThreadDef(RandNum, RandNum_Task, osPriorityAboveNormal, 0, 128);
  RandNumHandle = osThreadCreate(osThread(RandNum), NULL);

  /* definition and creation of LED_PC15 */
  osThreadDef(LED_PC15, LED_PC15_Task, osPriorityNormal, 0, 128);
  LED_PC15Handle = osThreadCreate(osThread(LED_PC15), NULL);

  /* definition and creation of LED_PC13 */
  osThreadDef(LED_PC13, LED_PC04_Task, osPriorityNormal, 0, 128);
  LED_PC13Handle = osThreadCreate(osThread(LED_PC13), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

